{
  "activity": {
    "admin": {
      "form": {
        "create": {
          "title": "Creating an activity"
        },
        "delete": {
          "confirm": "Are you sure you want to delete this activity?"
        }
      },
      "title": "Activity management"
    },
    "dashboard": {
      "title": "List of activities currently available."
    }
  },
  "admin": {
    "code": {
      "title": "Tutor session code"
    }
  },
  "avatar": {
    "generator": {
      "finished": "Do you want to save your new avatar?",
      "next-step": "Following",
      "previous-step": "Previous"
    },
    "drakus": {
      "background": "In the vast expanses of an ancient jungle, where the sun's rays barely penetrate through the dense foliage, lives Drakus, an unusual lizardman. \nBorn into a tribe of lizardmen known as Scaleshadow, Drakus is noted for his agility, cunning, and mastery of the bow.\n\nSince a young age, Drakus has trained tirelessly to become an exceptional archer. \nInspired by the tales of his tribe's legendary hunters, he spent hours perfecting his craft, learning to shoot accurately even while running through the dense jungle.\n\nBut Drakus wasn't just a skilled hunter; \nhe was also a vigilant protector of his tribe. \nWhen threats arose, whether from wild predators or rival tribes, Drakus always stood on the front lines to defend his people. \nHis knowledge of the terrain and mastery of the bow made him a formidable opponent for anyone who dared challenge the Scaleshadows.\n\nYet despite his strength and courage, Drakus carried the weight of a secret burden. \nIn his youth, he had lost his younger brother in an ambush by invaders. \nSince then, Drakus has carried the scar of this loss with him, vowing to protect his tribe at all costs and never let evil fall upon those he loved.\n\nThus, Drakus remains an iconic figure in the jungle, a symbol of bravery and determination for the Scaleshadows. \nAlways perched high in the trees, his bow ready to shoot a deadly arrow, he watches over his tribe with unwavering vigilance, ready to defend his home against any threat that dares to present itself."
    },
    "elara": {
      "background": "In the peaceful hamlet of Moonlight, located on the edge of the enchanted forest of Auroriel, Elara was born. \nFrom a young age, she was fascinated by the stars and the mysteries of nature. \nShe spent hours observing the night sky, dreaming of traveling through the stars.\n\nHer quiet life took an unexpected turn when she discovered an old grimoire hidden in the attic of her house. \nThe grimoire, written by an ancient witch, contained forgotten knowledge about magic and the secrets of the universe. \nFascinated by these discoveries, Elara began to study the grimoire in secret, learning the spells and incantations it contained.\n\nHowever, his practice of magic attracted the attention of the people of Moonlight, who were suspicious of wizards and witches. \nFearing that Elara was a threat to the community, they chased her from the village and forced her to go alone into the Auroriel Forest.\n\nDetermined to continue her studies of magic despite opposition, Elara took refuge in a secluded clearing deep in the forest. \nThere she found an old abandoned cabin where she settled and continued to practice magic, guided by her thirst for knowledge and her desire to master the mysterious forces that ruled the world.\n\nOver the years, Elara developed her magical skills and discovered her own unique power: the ability to manipulate natural elements. \nShe became an expert in elemental magic, capable of controlling fire, water, earth and air with impressive precision.\n\nThus, Elara forged her own destiny, becoming a powerful and respected magician throughout the kingdom of Auroriel. \nBut despite her fame, she never forgot where she came from, and always kept in her heart the memory of her humble past in Moonlight and her love for magic."
    },
    "erevan": {
      "background": "In the heart of the mystical lands of Eldoria, where legends come to life and magic permeates every breath of air, lived Yerevan, a young man of dazzling beauty with long hair silver like the glow of the moon. \nBorn in a small, remote village, surrounded by majestic mountains and green forests, Yerevan has always been linked to the destiny of his world.\n\nFrom a young age, Yerevan had been intrigued by the stories of ancient legends which spoke of the reapers, mystical beings responsible for guiding the souls of the deceased to the afterlife. \nFascinated by these stories, he vowed to follow the path of the Reapers and watch over those caught between worlds.\n\nHis chance came the day he discovered an ancient scythe hidden in a sacred cave on the top of a mountain. \nThe weapon seemed to be waiting for her, breaking the ancient seal that had held her prisoner for centuries. \nWith her, Yerevan felt invested with a strange power, as if his destiny had finally been revealed.\n\nWielding his new weapon and guided by his inner calling, Yerevan embarked on a quest to become a Reaper. \nHis scythe, chiseled with mystical designs, glowed with a silvery glow, while his hair flowed behind him like a silver veil in the breeze.\n\nDuring his journey, Yerevan encountered ancestral spirits, magical creatures and dark forces that threatened the balance of Eldoria. \nArmed with his scythe and determination, he faced each challenge with courage and compassion, guiding lost souls toward the light and pushing back the darkness that loomed over his world.\n\nDespite the dangers and sacrifices, Yerevan remained faithful to his quest, becoming a living legend throughout Eldoria. \nHis name echoed across the lands, bringing hope and comfort to those who were lost. \nAnd as he continued his journey, his silver hair shone like a beacon in the night, announcing the presence of a hero destined to light dark paths and guide souls to eternal peace."
    },
    "fenrir": {
      "background": "In the dark woods of Lycanthor Forest, where trees stand sentinel and wolves howl at the moon, lives Fenrir, a wolfman of noble heart and legendary bravery. \nBorn among his own people, into a proud and powerful pack, Fenrir is distinguished by his imposing stature, his raw strength and his keen sense of honor.\n\nFrom a young age, Fenrir has trained tirelessly to become a fearsome warrior. \nInspired by the tales of his pack's legendary heroes, he spent hours perfecting his art of combat, learning to wield the sword with grace and defend his companions with dedication.\n\nEquipped with a sword forged in the flames of the pack's ancestral forges and clad in plate armor forged from the strongest metal, Fenrir stands ready to face the dangers that lurk in the darkness of the forest.\n\nBut Fenrir was not only a skilled warrior; \nhe was also a devoted protector of his pack. \nWhen threats arose, whether from malicious creatures or intruders seeking to invade their territory, Fenrir always stood on the front lines to defend his people. \nHis shield, decorated with the symbol of the pack, was always raised to protect his companions from enemy attacks.\n\nYet, despite his strength and courage, Fenrir carried the weight of a secret burden. \nIn his youth, his pack had been decimated by merciless hunters, leaving Fenrir as the last of his blood. \nSince then, Fenrir carried the scar of that loss with him, vowing to protect his remaining wolves at all costs and never let evil befall those he loved.\n\nThus, Fenrir remains an iconic figure in the forest, a symbol of strength and loyalty for the wolves of Lycanthor. \nAlways ready to face the dangers that threaten his people, he watches over his pack with unwavering vigilance, ready to defend their territory against any threat that dares to present itself."
    }
  },
  "character": {
    "code": {
      "title": "Character Code"
    },
    "creation": {
      "avatar": "Avatar selection",
      "password": "Creating the password",
      "pseudo": "Player nickname",
      "title": "Creation of the player character"
    }
  },
  "common": {
    "actions": "Actions",
    "activity": "Activities)",
    "add": "Add",
    "administration": "Administration",
    "already-have-account": "Already have an account?",
    "cancel": "Cancel",
    "change-character": "Change character",
    "character": "Character",
    "clear": "To erase",
    "confirm": "Confirm",
    "create": "Create",
    "date": "Date",
    "deletion": "Deletion",
    "description": "Description",
    "error": "Error",
    "gold": "Gold coin",
    "invite": "Invite",
    "join": "Join",
    "login": "Connection",
    "logout": "Disconnect",
    "name": "Name",
    "not-have-account": "No account yet?",
    "or": "Or",
    "profile": "Profile",
    "quest": "Quest(s)",
    "redirect": "Redirection...",
    "register": "Registration",
    "register-success": "Registration successful, a confirmation email has been sent to you",
    "register-with-google": "Sign in with Google",
    "save": "Save",
    "select-character": "Select your character",
    "status": "Status",
    "tutor": "Tutor",
    "family": "Family",
    "history": "Historical",
    "me": "My information",
    "add-character": "Add a character",
    "next": "Following",
    "previous": "Previous"
  },
  "create-password": {
    "title": "Creating your password"
  },
  "family": {
    "add": {
      "title": "Creating your family"
    },
    "admin": {
      "title": "Managing my family members"
    },
    "character": "Character",
    "detail": {
      "title": "Members of the {familyName} family"
    },
    "join": {
      "title": "Join a family"
    },
    "member": {
      "gold": {
        "add-remove": "How many gold coins do you want to add or remove to",
        "current-golds": "Current number of gold coins",
        "golds": "gold coins",
        "new-golds": "New number of gold coins",
        "title": "Edit number of gold coins"
      }
    },
    "tutor": "Tutor"
  },
  "footer": {
    "terms": "© 2021 - All rights reserved"
  },
  "form": {
    "error": {
      "code": {
        "length": "The code must be 6 digits long",
        "wrong": "The code is incorrect, are you sure you have entered it correctly?"
      },
      "email": {
        "invalid": "Email is invalid",
        "required": "Email is required"
      },
      "family-name": {
        "required": "Last name is required"
      },
      "golds": {
        "minValue": "The total number of gold coins remaining must be greater than or equal to 0"
      },
      "password": {
        "invalid": "The password must contain at least one uppercase letter, one lowercase letter, one number and one special character",
        "required": "Password is required"
      },
      "pseudo": {
        "required": "The nickname is obligatory"
      },
      "quest": {
        "description": {
          "required": "Quest description is required"
        },
        "golds": {
          "minValue": "The number of gold coins must be greater than 0",
          "required": "The number of gold coins is required"
        },
        "name": {
          "required": "Quest name is required"
        }
      },
      "password-image": {
        "min-length": "You must select 6 images"
      }
    },
    "hint": {
      "code": "6-digit code (ex: 123456)",
      "password": "8 characters minimum with an uppercase letter, a lowercase letter, a number and a special character"
    },
    "label": {
      "actual-code": "current code",
      "code": "Tutor session code",
      "email": "E-mail",
      "family-name": "Surname",
      "new-code": "New code",
      "password": "Password",
      "pseudo": "Pseudo",
      "quest": {
        "description": "Description",
        "golds": "Number of gold coins",
        "name": "Name"
      }
    }
  },
  "history": {
    "admin": {
      "title": "Transaction History"
    }
  },
  "me": {
    "admin": {
      "title": "My information"
    }
  },
  "member": {
    "check-code": {
      "error": "Invalid code"
    }
  },
  "notification": {
    "create-password": {
      "error": "Error creating password",
      "success": "Password created"
    },
    "delete": {
      "error": "Error while deleting",
      "success": "Deletion successful"
    },
    "invite": {
      "error": "Error sending invitation",
      "success": "Invitation sent"
    },
    "save": {
      "error": "Error saving",
      "success": "recording completed"
    },
    "update": {
      "error": "Error during update",
      "success": "Successful update"
    }
  },
  "quest": {
    "admin": {
      "form": {
        "create": {
          "title": "Creating a quest"
        },
        "delete": {
          "confirm": "Are you sure you want to delete this quest?"
        },
        "edit": {
          "characterField": "Who should assign the quest to?",
          "characterFieldReset": "Do not assign?",
          "title": "Edit a quest"
        },
        "validate": {
          "message": "Was the quest successfully completed?",
          "title": "Validate the quest"
        }
      },
      "title": "Quest management"
    },
    "dashboard": {
      "card": {
        "emptyCharacter": "Unassigned"
      },
      "form": {
        "title": {
          "asCharacter": "This quest has already been assigned to a child.",
          "asNotCharacter": "Do you want to do this quest?",
          "enoughGolds": "Do you want to do this quest?"
        }
      },
      "title": "List of quests available at the moment."
    },
    "item": {
      "golds": "gold coins"
    },
    "status": {
      "pending": "On hold",
      "toBeValidate": "To validate",
      "validated": "Validated"
    }
  },
  "welcome": {
    "title": "Welcome to the family management app"
  }
}
