{
  "common": {
    "confirm": "Confirmer",
    "cancel": "Annuler",
    "save": "Enregistrer",
    "create": "Créer",
    "date": "Date",
    "deletion": "Suppression",
    "add": "Ajouter",
    "error": "Erreur",
    "login": "Connexion",
    "logout": "Déconnexion",
    "invite": "Inviter",
    "redirect": "Redirection...",
    "register": "Inscription",
    "register-with-google": "Se connecter avec Google",
    "already-have-account": "Déjà un compte ?",
    "not-have-account": "Pas encore de compte ?",
    "register-success": "Inscription réussie, un mail de confirmation vous a été envoyé",
    "join": "Rejoindre",
    "or": "ou",
    "name": "Nom",
    "description": "Description",
    "gold": "Pièce d'or",
    "tutor": "Tuteur",
    "status": "Statut",
    "quest": "Quête(s)",
    "activity": "Activité(s)",
    "family": "Famille",
    "administration": "Administration",
    "history": "Historique des transactions",
    "clear": "Effacer",
    "me": "Mes informations",
    "actions": "Actions",
    "profile": "Profile",
    "select-character": "Selectionne ton personnage",
    "change-character": "Changer de personnage",
    "character": "Personnage",
    "next": "Suivant",
    "previous": "Précédent",
    "add-character": "Ajouter un personnage"
  },
  "welcome": {
    "title": "Bienvenue sur l'application de gestion de famille"
  },
  "family": {
    "detail": {
      "title": "Les membres de la famille {familyName}"
    },
    "add": {
      "title": "Création de votre famille"
    },
    "join": {
      "title": "Rejoindre une famille"
    },
    "tutor": "Tuteur",
    "member": {
      "gold": {
        "title": "Éditer le nombre de pièces d'or",
        "current-golds": "Nombre de pièces d'or actuel",
        "add-remove": "Combien de pièces d'or voulez vous ajouter ou supprimer à",
        "golds": "pièces d'or",
        "new-golds": "Nouveau nombre de pièces d'or"
      }
    },
    "admin": {
      "title": "Gestion des membres de ma famille"
    },
    "character": "Personnage"
  },
  "create-password": {
    "title": "Création de votre mot de passe"
  },
  "form": {
    "error": {
      "pseudo": {
        "required": "Le pseudo est obligatoire"
      },
      "email": {
        "required": "L'email est obligatoire",
        "invalid": "L'email n'est pas valide"
      },
      "code": {
        "wrong": "Le code est incorrect, êtes-vous sûr de l'avoir bien saise ?",
        "length": "Le code doit faire 6 chiffres"
      },
      "family-name": {
        "required": "Le nom de famille est obligatoire"
      },
      "password": {
        "required": "Le mot de passe est obligatoire",
        "invalid": "Le mot de passe doit contenir au moins une majuscule, une minuscule, un chiffre et un caractère spécial"
      },
      "golds": {
        "minValue": "Le nombre de pièces d'or total restant doit être supérieur ou égale à 0"
      },
      "quest": {
        "name": {
          "required": "Le nom de la quête est obligatoire"
        },
        "description": {
          "required": "La description de la quête est obligatoire"
        },
        "golds": {
          "required": "Le nombre de pièces d'or est obligatoire",
          "minValue": "Le nombre de pièces d'or doit être supérieur à 0"
        }
      },
      "password-image": {
        "min-length": "Tu dois selectionner 6 images"
      }
    },
    "label": {
      "pseudo": "Pseudo",
      "code": "Code de la session tuteur",
      "family-name": "Nom de famille",
      "email": "Email",
      "password": "Mot de passe",
      "actual-code": "Code actuel",
      "new-code": "Nouveau code",
      "quest": {
        "name": "Nom",
        "description": "Description",
        "golds": "Nombre de pièces d'or"
      }
    },
    "hint": {
      "code": "Code à 6 chiffres (ex: 123456)",
      "password": "8 caractères minimum avec une majuscule, une minuscule, un chiffre et un caractère spécial"
    }
  },
  "footer": {
    "terms": "© 2021 - Tout droits réservés"
  },
  "notification": {
    "save": {
      "success": "Enregistrement réussi",
      "error": "Erreur lors de l'enregistrement"
    },
    "delete": {
      "success": "Suppression réussie",
      "error": "Erreur lors de la suppression"
    },
    "invite": {
      "success": "Invitation envoyée",
      "error": "Erreur lors de l'envoi de l'invitation"
    },
    "update": {
      "success": "Mise à jour réussie",
      "error": "Erreur lors de la mise à jour"
    },
    "create-password": {
      "success": "Mot de passe créé",
      "error": "Erreur lors de la création du mot de passe"
    }
  },
  "history": {
    "admin": {
      "title": "Historique des transactions"
    }
  },
  "quest": {
    "admin": {
      "title": "Gestion des quêtes",
      "form": {
        "create": {
          "title": "Création d'une quête"
        },
        "edit": {
          "title": "Editer une quête",
          "characterField": "À qui attribuer la quête ?",
          "characterFieldReset": "Ne pas attribuer ?"
        },
        "delete": {
          "confirm": "Êtes vous sûr de vouloir supprimer cette quête ?"
        },
        "validate": {
          "title": "Valider la quête",
          "message": "La quête à bien été faite ?"
        }
      }
    },
    "dashboard": {
      "title": "Liste des quêtes disponible en ce moment.",
      "form": {
        "title": {
          "asCharacter": "Cette quête a déjà été attribuée à un enfant.",
          "asNotCharacter": "As tu terminé cette quete ? ",
          "enoughGolds": "Veux tu effectuer cette quête ?\t"
        }
      },
      "card": {
        "emptyCharacter": "Non attribuée"
      }
    },
    "item": {
      "golds": "po"
    },
    "status": {
      "pending": "En attente",
      "toBeValidated": "À valider",
      "validated": "Validée"
    }
  },
  "activity": {
    "dashboard": {
      "title": "Liste des activités disponible en ce moment."
    },
    "admin": {
      "title": "Gestion des activités",
      "form": {
        "create": {
          "title": "Création d'une activité"
        },
        "delete": {
          "confirm": "Êtes vous sûr de vouloir supprimer cette activité ?"
        }
      }
    }
  },
  "member": {
    "check-code": {
      "error": "Code invalide"
    }
  },
  "admin": {
    "code": {
      "title": "Code de la session tuteur"
    }
  },
  "me": {
    "admin": {
      "title": "Mes informations"
    }
  },
  "avatar": {
    "elara": {
      "background": "Dans le paisible hameau de Clairdelune, situé au bord de la forêt enchantée d'Auroriel, naquit Elara. Dès son plus jeune âge, elle était fascinée par les étoiles et les mystères de la nature. Elle passait des heures à observer le ciel nocturne, rêvant de voyager à travers les étoiles.\nSa vie tranquille prit un tournant inattendu lorsqu'elle découvrit un vieux grimoire caché dans le grenier de sa maison. Le grimoire, écrit par une ancienne sorcière, renfermait des connaissances oubliées sur la magie et les secrets de l'univers. Fascinée par ces découvertes, Elara commença à étudier le grimoire en secret, apprenant les sorts et les incantations qu'il contenait.\nCependant, sa pratique de la magie attira l'attention des habitants de Clairdelune, qui étaient méfiants envers les sorciers et les sorcières. Craignant qu'Elara ne soit une menace pour la communauté, ils la chassèrent du village et la forcèrent à partir seule dans la forêt d'Auroriel.\nDéterminée à poursuivre ses études de magie malgré l'opposition, Elara se réfugia dans une clairière isolée au cœur de la forêt. Là, elle trouva une vieille cabane abandonnée où elle s'installa et continua à pratiquer la magie, guidée par sa soif de connaissance et sa volonté de maîtriser les forces mystérieuses qui régissaient le monde.\nAu fil des années, Elara développa ses compétences magiques et découvrit son propre pouvoir unique : la capacité à manipuler les éléments naturels. Elle devint une experte en magie élémentaire, capable de contrôler le feu, l'eau, la terre et l'air avec une précision impressionnante.\nAinsi, Elara forgea son propre destin, devenant une magicienne puissante et respectée dans tout le royaume d'Auroriel. Mais malgré sa renommée, elle n'oublia jamais d'où elle venait, et garda toujours dans son cœur le souvenir de son humble passé à Clairdelune et de son amour pour la magie."
    },
    "drakus": {
      "background": "Dans les vastes étendues d'une jungle ancienne, là où les rayons du soleil percent à peine à travers le feuillage dense, vit Drakus, un homme lézard hors du commun. Né dans une tribu d'hommes lézards connue sous le nom de Scaleshadow, Drakus se distingue par son agilité, sa ruse et sa maîtrise de l'arc.\nDepuis son plus jeune âge, Drakus s'est entraîné sans relâche pour devenir un archer d'exception. Inspiré par les récits des chasseurs légendaires de sa tribu, il a consacré des heures à perfectionner son art, apprenant à tirer avec précision même en pleine course à travers la jungle dense.\nMais Drakus n'était pas seulement un chasseur habile ; il était également un protecteur vigilant de sa tribu. Lorsque des menaces se présentaient, qu'il s'agisse de prédateurs sauvages ou de tribus rivales, Drakus se tenait toujours en première ligne pour défendre les siens. Sa connaissance du terrain et sa maîtrise de l'arc en faisaient un adversaire redoutable pour quiconque osait défier les Scaleshadows.\nPourtant, malgré sa force et son courage, Drakus portait le poids d'un fardeau secret. Dans sa jeunesse, il avait perdu son frère cadet lors d'une embuscade tendue par des envahisseurs. Depuis lors, Drakus portait la cicatrice de cette perte avec lui, jurant de protéger sa tribu à tout prix et de ne jamais laisser le mal s'abattre sur ceux qu'il aimait.\nAinsi, Drakus demeure une figure emblématique dans la jungle, un symbole de bravoure et de détermination pour les Scaleshadows. Toujours perché en haut des arbres, son arc prêt à décocher une flèche mortelle, il veille sur sa tribu avec une vigilance sans faille, prêt à défendre son foyer contre toute menace qui oserait se présenter."
    },
    "fenrir": {
      "background": "Dans les sombres bois de la forêt de Lycanthor, où les arbres se dressent comme des sentinelles et les loups hurlent à la lune, vit Fenrir, un homme-loup au cœur noble et à la bravoure légendaire. Né parmi les siens, dans une meute fière et puissante, Fenrir se distingue par sa stature imposante, sa force brute et son sens aigu de l'honneur.\nDepuis son plus jeune âge, Fenrir s'est entraîné sans relâche pour devenir un guerrier redoutable. Inspiré par les récits des héros légendaires de sa meute, il a consacré des heures à perfectionner son art du combat, apprenant à manier l'épée avec grâce et à défendre ses compagnons avec dévouement.\nÉquipé d'une épée forgée dans les flammes des forges ancestrales de la meute et revêtant une armure de plaque forgée avec le métal le plus robuste, Fenrir se tient prêt à affronter les dangers qui guettent dans les ténèbres de la forêt.\nMais Fenrir n'était pas seulement un guerrier habile ; il était également un protecteur dévoué de sa meute. Lorsque des menaces se présentaient, qu'il s'agisse de créatures malveillantes ou d'intrus cherchant à envahir leur territoire, Fenrir se tenait toujours en première ligne pour défendre les siens. Son bouclier, orné du symbole de la meute, était toujours levé pour protéger ses compagnons des attaques ennemies.\nPourtant, malgré sa force et son courage, Fenrir portait le poids d'un fardeau secret. Dans sa jeunesse, sa meute avait été décimée par des chasseurs impitoyables, laissant Fenrir comme le dernier de son sang. Depuis lors, Fenrir portait la cicatrice de cette perte avec lui, jurant de protéger les loups qui lui restaient à tout prix et de ne jamais laisser le mal s'abattre sur ceux qu'il aimait.\nAinsi, Fenrir demeure une figure emblématique dans la forêt, un symbole de force et de loyauté pour les loups de Lycanthor. Toujours prêt à affronter les dangers qui menacent son peuple, il veille sur sa meute avec une vigilance sans faille, prêt à défendre leur territoire contre toute menace qui oserait se présenter."
    },
    "erevan": {
      "background": "Au cœur des terres mystiques d'Eldoria, où les légendes prennent vie et où la magie imprègne chaque souffle d'air, vivait Erevan, un jeune homme d'une beauté éblouissante aux longs cheveux argentés comme la lueur de la lune. Né dans un petit village reculé, entouré de montagnes majestueuses et de forêts verdoyantes, Erevan était depuis toujours lié au destin de son monde.\nDès son plus jeune âge, Erevan avait été intrigué par les récits des anciennes légendes qui parlaient des faucheurs, des êtres mystiques chargés de guider les âmes des défunts vers l'au-delà. Fasciné par ces histoires, il s'était juré de suivre le chemin des faucheurs et de veiller sur ceux qui étaient pris entre les mondes.\nSa chance arriva le jour où il découvrit une antique faux cachée dans une grotte sacrée au sommet d'une montagne. L'arme semblait l'attendre, brisant le sceau ancien qui la retenait prisonnière depuis des siècles. Avec elle, Erevan se sentit investi d'une puissance étrange, comme si son destin était enfin révélé.\nArborant sa nouvelle arme et guidé par son appel intérieur, Erevan se lança dans une quête pour devenir un faucheur. Sa faux, ciselée avec des motifs mystiques, brillait d'une lueur argentée, tandis que sa chevelure flottait derrière lui tel un voile argenté dans la brise.\nAu cours de son périple, Erevan rencontra des esprits ancestraux, des créatures magiques et des forces obscures qui menaçaient l'équilibre d'Eldoria. Armé de sa faux et de sa détermination, il affronta chaque défi avec courage et compassion, guidant les âmes égarées vers la lumière et repoussant les ténèbres qui planaient sur son monde.\nMalgré les dangers et les sacrifices, Erevan resta fidèle à sa quête, devenant une légende vivante dans tout Eldoria. Son nom résonnait à travers les terres, porteur d'espoir et de réconfort pour ceux qui étaient perdus. Et tandis qu'il continuait son voyage, sa chevelure argentée brillait comme un phare dans la nuit, annonçant la présence d'un héros destiné à éclairer les chemins sombres et à guider les âmes vers la paix éternelle."
    }
  },
  "character": {
    "code": {
      "title": "Code du personnage"
    },
    "creation": {
      "pseudo": "Pseudo du joueur",
      "password": "Creation du mot de passe",
      "avatar": "Selection de l'avatar",
      "title": "Création du personnage joueur"
    }
  }
}
